erp3l/src/Catalogs/БланкиОтчетов/БланкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БланкиОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Макет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияПоУмолчанию</name>
    <type>
      <types>EnumRef.ПорядкиОкругленияОтчетности</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньТочностиПоУмолчанию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоУмолчаниюВВидеБланка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Утвержден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскрытиеВМакете</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСлева</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФиксацияСверху</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БланкДляОтображения</name>
    <comment>Данный бланк используется только для отображения, так как не содержит всех ключевых реквизитов аналитик</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаШапки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодвала</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шапка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подвал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСтруктуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСводнойТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ИерархияГруппировокКолонок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ракурс</name>
    <type>
      <types>CatalogRef.ОбластиДанныхВидовОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимБланка</name>
    <comment>0 - Однопериодный бланк, 1- Сводная таблица, 2 - Многопериодный бланк</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультиязычный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетРаскрытий</name>
    <comment>Содержит ТЧ частей макета для каждой группы раскрытия</comment>
    <attributes>
      <name>КодГруппыРаскрытия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>45</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Макет</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнаяЧасть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АдресаЭлементовСтруктурыОтчета</name>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>EnumRef.ЭлементыСтруктурыОтчета</types>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>CatalogRef.СтрокиОтчетов</types>
        <types>CatalogRef.КолонкиОтчетов</types>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресС1К1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеБланки</name>
    <attributes>
      <name>Бланк</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦветЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КартинкаЗакладки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/БланкиОтчетов/Forms/ФормаКопирования/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
    БланкИсточник = Параметры.ЗначениеКопирования;	
	Владелец = БланкИсточник.Владелец;
	ПериодичностьБюджетирования = БланкИсточник.Периодичность;
	ЕдиницаИзмеренияПоУмолчанию = БланкИсточник.ЕдиницаИзмеренияПоУмолчанию;
	ИерархияГруппировокСтрок = БланкИсточник.ИерархияГруппировокСтрок;
    ИерархияГруппировокКолонок = БланкИсточник.ИерархияГруппировокКолонок;
	
	
	
	СписокПараметровКопирования.Добавить("СтрокиБланка", Нстр("ru = 'Состав строк'"), Истина);
	СписокПараметровКопирования.Добавить("КолонкиБланка", Нстр("ru = 'Состав показателей'"), Истина);
	СписокПараметровКопирования.Добавить("СтруктураОсейБланка", Нстр("ru = 'Расположение осей бланка'"), Истина);
	СписокПараметровКопирования.Добавить("НастройкаШкалыПериодов", Нстр("ru = 'Настройка периодов'"), Истина);
	СписокПараметровКопирования.Добавить("НастройкиАналитик", Нстр("ru = 'Настройки аналитик'"), Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураПараметров = Новый Структура;
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Владелец",Владелец);
    ПараметрыЗаполнения.Вставить("РежимБланка",1);
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	Если Не ЗначениеЗаполнено(ИмяНовойФормы) Тогда
		ОбщегоНазначенияУх.СообщитьОбОшибке(НСтр("ru = 'Необходимо заполнить наименование новой формы!'"));
		Возврат;
	КонецЕсли;	

		
	ФормаСводнойТаблицы = ПолучитьФорму("Справочник.БланкиОтчетов.Форма.ФормаМакетаСводнаяТаблица",СтруктураПараметров,Владелец);
	
	ФормаСводнойТаблицы.Объект.Наименование = ИмяНовойФормы;
    ФормаСводнойТаблицы.Объект.РежимБланка = 1;
	ФормаСводнойТаблицы.Объект.Периодичность = ПериодичностьБюджетирования;
	ФормаСводнойТаблицы.Объект.ЕдиницаИзмеренияПоУмолчанию = ЕдиницаИзмеренияПоУмолчанию;
	ФормаСводнойТаблицы.Объект.ИерархияГруппировокСтрок = ИерархияГруппировокСтрок;
	ФормаСводнойТаблицы.Объект.ИерархияГруппировокКолонок = ИерархияГруппировокКолонок;
	ФормаСводнойТаблицы.Записать();
	СкопироватьНастройкиИсточника(БланкИсточник,ФормаСводнойТаблицы.Объект.Ссылка);
	ФормаСводнойТаблицы.ПрочитатьСтруктуруТаблицы();
	ФормаСводнойТаблицы.Открыть();

	Закрыть(СписокПараметровКопирования);
КонецПроцедуры


&НаСервере
Процедура СкопироватьНастройкиИсточника(БланкИсточник,Бланк)
	
	   СводнаяТаблицаУХ.СкопироватьНастройкиБланка(БланкИсточник,Бланк,СписокПараметровКопирования);
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвойстваОбъекта(БланкИсточник,Бланк)
	
	   ЗаполнитьЗначенияСвойств(Бланк,БланкИсточник);
		
КонецПроцедуры
